# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Minimal detection model exercising AGDownV2 and AGUpV2 custom modules.

nc: 80
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  - [-1, 1, AGDownV2, [32]] # 1-P2/4
  - [-1, 1, AGDownV2, [64]] # 2-P3/8
  - [-1, 1, AGDownV2, [128]] # 3-P4/16
  - [-1, 1, AGDownV2, [256]] # 4-P5/32

head:
  - [-1, 1, AGUpV2, [128]] # 5-P4/16
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 1, Conv, [128, 3, 1]] # 7-P4/16

  - [-1, 1, AGUpV2, [64]] # 8-P3/8
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, Conv, [64, 3, 1]] # 10-P3/8

  - [[10, 7, 4], 1, Detect, [nc]] # Detect(P3, P4, P5)
