# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR-l hybrid object detection model with center-aware query reranking and AFEM after stage 1
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=rtdetr-l-center-afem.yaml' will call this file with scale 'l'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # 1 stage 1
  - [-1, 1, AFEM, [128]] # 2 AFEM after stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 3-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]] # 4 stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 5-P4/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]] # 6 cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]] # 7
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]] # 8 stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]] # 9-P5/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]] # 10 stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 11 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 12
  - [-1, 1, Conv, [256, 1, 1]] # 13 Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [8, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 15 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 16
  - [-1, 3, RepC3, [256]] # 17 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 18 Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 20 input_proj.0
  - [[-2, -1], 1, Concat, [1]] # 21 cat backbone P3
  - [-1, 3, RepC3, [256]] # 22 X3, fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 23 downsample_convs.0
  - [[-1, 18], 1, Concat, [1]] # 24 cat Y4
  - [-1, 3, RepC3, [256]] # 25 F4, pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 26 downsample_convs.1
  - [[-1, 13], 1, Concat, [1]] # 27 cat Y5
  - [-1, 3, RepC3, [256]] # 28 F5, pan_blocks.1

  - [[22, 25, 28], 1, CenterRTDETRDecoder, [nc]] # 29 CenterRTDETRDecoder(P3, P4, P5)
